#include <stdio.h>

int main() {

	int i;

	for(i = 1; i <= 10; i++) { // ето как по принцип изглежда for()...Характерно за него е 1) има 3 полета - поле за инициализация; условие; инкрементация
		printf("%d",i); // ползва се сравнително често и е доста важен
	} // може да не се изпълни нито 1 път.Алгоритъмът за for-а е: първо винаги се изпълнява инициализацията. после идва ред на условието(ако не се изпълни просто излиза от него). после отива в тялото и накрая(но не на последно място) отива в инкрементацията
	printf("\n");

	for(;;) { //технически това е безкраен for цикъл...напълно валиден, но е малко тъпо ако не го break-нете...или е той или Важият компютър
		printf("%d",i);
		i++;
		if(i == 15)
			break; // има както break, така и continue(надзърнете в while.c за обяснение(за какво служат))
	}
	i = 0;
	for(/*за това говоря...*/; i < 10; i++) { //може да се пропускат и полета :ОООООООО ОМФГ Best language ever!!!
		printf("%d",i);
	}

	return 0;
}

//Бачков©